In [4]:
import utm
import pandas as pd

In [39]:
ut = pd.read_excel('utm.xlsx')
ut

               X             Y
0  484225.383586  7.052807e+06
1  484114.315785  7.054081e+06
2  484636.690973  7.058356e+06
3  484814.152935  7.051490e+06

In [40]:
con = utm.to_latlon(ut['X'],ut['Y'],36,'J')

In [41]:
print(con[1])
print(con[0])

0    32.8415
1    32.8404
2    32.8457
3    32.8474
dtype: float64
0   -26.6456
1   -26.6341
2   -26.5955
3   -26.6575
dtype: float64

In [16]:
ut['lon'] = con[0]
ut['lat'] = con[1]

In [17]:
ut.head()

               X             Y      lon      lat
0  484225.383586 -2.947193e+06  32.8415 -26.6456
1  484114.315785 -2.945919e+06  32.8404 -26.6341
2  484636.690973 -2.941644e+06  32.8457 -26.5955
3  484814.152935 -2.948510e+06  32.8474 -26.6575

In [37]:
# Funcao

def utm_para_latlon(dataframe, zona, letra):
    lat_lon = utm.to_latlon(dataframe['X'],dataframe['Y'], zona, str(letra))
    dataframe['Longitude'] = lat_lon[1]
    dataframe['Latitude'] = lat_lon[0]

In [38]:
# Testando a funcao
data = pd.read_excel('utm_2.xlsx')
utm_para_latlon(data, 36, 'J')
data.to_excel('utm_to_ll.xlsx')
data.head()

               X             Y  Longitude  Latitude
0  484225.383586 -2.947193e+06    32.8415  -26.6456
1  484114.315785 -2.945919e+06    32.8404  -26.6341
2  484636.690973 -2.941644e+06    32.8457  -26.5955
3  484814.152935 -2.948510e+06    32.8474  -26.6575
4  479489.030079 -2.947831e+06    32.7939  -26.6513